{
  "_name_or_path": "antypasd/tweet-topic-21-multi",
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "arts_&_culture",
    "1": "business_&_entrepreneurs",
    "2": "celebrity_&_pop_culture",
    "3": "diaries_&_daily_life",
    "4": "family",
    "5": "fashion_&_style",
    "6": "film_tv_&_video",
    "7": "fitness_&_health",
    "8": "food_&_dining",
    "9": "gaming",
    "10": "learning_&_educational",
    "11": "music",
    "12": "news_&_social_concern",
    "13": "other_hobbies",
    "14": "relationships",
    "15": "science_&_technology",
    "16": "sports",
    "17": "travel_&_adventure",
    "18": "youth_&_student_life"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "arts_&_culture": 0,
    "business_&_entrepreneurs": 1,
    "celebrity_&_pop_culture": 2,
    "diaries_&_daily_life": 3,
    "family": 4,
    "fashion_&_style": 5,
    "film_tv_&_video": 6,
    "fitness_&_health": 7,
    "food_&_dining": 8,
    "gaming": 9,
    "learning_&_educational": 10,
    "music": 11,
    "news_&_social_concern": 12,
    "other_hobbies": 13,
    "relationships": 14,
    "science_&_technology": 15,
    "sports": 16,
    "travel_&_adventure": 17,
    "youth_&_student_life": 18
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.19.2",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
